<?php

class Auto
{
    // свойства
    public $color;
    public $speed;
    public $name;
    public static $model = "Автомобиль";
//----------------------------------------------------------------------------------------------------------------------
    // методы
    public function __construct($n,$c,$s)
    {
        $this->name = $n;
        $this->color = $c;
        $this->speed = $s;

        $this->aboutAuto();
    }
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
    public function aboutAuto()
    {
        echo "<br><br> ".$this->color." ".static::$model." ".$this->name." "." едет со скоростью ".$this->speed."км/ч.";
    }
}